# ColorOptions Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ColorOptions Properties
ColorOptions Class See Also
---
The ColorOptions type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AlertColor | The color of the current canvas theme used to highlight elements when a special alert is required. |
| BackgroundColor | The background color of the current canvas theme applied to views. |
| CalculatingColor | The color of the current canvas theme used to render elements when some aspect of their properties is currently being recalculated. |
| EditingColor | The color of the current canvas theme used to render elements when editing. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| PreselectionColor | The color of the current canvas theme used to highlight candidates for selection before they are selected. |
| SelectionColor | The color of the current canvas theme used to highlight selected elements. |
| SelectionSemitransparent | Indicates whether or not selections will be shown in a semi-transparent manner in current canvas theme. |

# See Also
ColorOptions Class
Autodesk.Revit.DB Namespace